In [6]:
import pandas as pd
import numpy as np

#### 연습문제

In [7]:
df= pd.DataFrame(
{'a':[4,5,6,6],
 'b': [7,8,9,9],
 'c':[10,11,12,12]},
 index = [1,2,3,4])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [12]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [13]:
df.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [49]:
df2= pd.DataFrame (
    [[4,7,10],
    [5,8,11],
    [6,9,12],sss
    [6,9,12]],
    index = [1,2,3,4],
    columns = ['a','b','c'])

df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

1) df2의 행렬 바꾼 결과를 df3으로 지정?

In [4]:
df3 = df2.T
df3

    0   1   2   3
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

2) df3의 열이름을 a,b,c,d,e로 지정?

In [5]:
df3.columns=['a','b','c','d']
df3

    a   b   c   d
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

3) df3의 인덱스를 11,22,33으로 지정?

In [9]:
df3.index=[11,22,33]
df3

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [11]:
df3.rename(columns ={'a':'A','b':'B','c':'C','d':'D'})

     A   B   C   D
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [8]:
df4 = df3.rename(columns ={'a':'A','b':'B','c':'C','d':'D'})
df4

     A   B   C   D
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

#### 주의 *rename은 실행결과로 변경된 것을 보여주지만, 원본데이터에는 직접저장하지 않는다*
결과값을 다른 변수에 담는 과정을 실행해야함!

*비교연산자를 이용한 조회

In [14]:
# 크거나 > 작거나 < >=, <=, 같다 == 같지않다 !=

In [15]:
df.b>7 #

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [16]:
df[df.b>7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

* False 누락, True에 해당하는 값만 출력한 데이터조회

In [19]:
df[df.c>7] #c열을 기준으로 7보다 큰 값의 행을 조회하기

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [20]:
df[df['c']>7] # == df[df.c>7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

* 열 이름이 한글이나 특수문자 있는 경우 df['열이름']

In [23]:
df[df['c']== 10]

   a  b   c
1  4  7  10

In [24]:
df['b'] !=7

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [27]:
df[df['b']!=7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

### 중복 행 제거하는 drop_duplicates()

In [31]:
#도움말 보기
df.drop_duplicates?

In [33]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of    a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12>

In [37]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

##### 변수에 담지 않아서 중복 행 제거한 결과가 원본data에 적용되지 않음

In [36]:
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

* inplace : 중복되어있는 값을 누락시킬때 쓰는 새로 재배치 혹은 복사 inplace=False 원본을 바로 적용시키지 않음

In [40]:
df.drop_duplicates(inplace=True)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

* inplace = True 옵션은 원본에 바로 적용시키라는 뜻의 옵션
* Pandas 에서는 drop_duplicates(inplace = Ture)를 비추함
* 대신 df = df.drop_duplicates() 이런 형식을 권장 (원본 재지정)

In [50]:
df = df2 #중복행 제거했던 것을 다시 되돌리기 위해 입력함!
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

*  중복된 값이 있다면 첫번째 행은 살려놔!!

In [53]:
df.drop_duplicates(keep='first') # df 결과가 원본에 저장되지 않음

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [55]:
df.drop_duplicates(keep='last') # df 결과가 원본에 반영되지 않음

   a  b   c
1  4  7  10
2  5  8  11
4  6  9  12